{
  "list": "- **arxiv-watcher**: Search and summarize papers from ArXiv. Supports JSON and Markdown output.\n- **autogame-tales**: AutoGame Ghost Story Generator\n- **byterover**: Manage project knowledge using ByteRover context tree.\n- **capability-evolver**: A self-evolution engine for AI agents. Features automated log analysis, genetic mutation (randomized...\n- **cursor-agent**: A comprehensive skill for using the Cursor CLI agent for various software engineering tasks (updated...\n- **ddg-search**: Perform web searches using DuckDuckGo. Use when web search is needed and no API key is available or ...\n- **duby**: Convert text to speech using Duby.so API. Supports various voices and emotions.\n- **feishu-attendance**: Feishu Attendance Monitoring Skill\n- **feishu-card**: Send rich interactive cards to Feishu. v1.4.1 adds atomic file writes for stability.\n- **feishu-doc**: Fetch content from Feishu Wiki/Doc/Sheet/Bitable\n- **feishu-sticker**: Send images as native Feishu stickers. Features auto-upload, caching, and GIF-to-WebP conversion.\n- **gateway-manager**: Handles administrative menu events from Feishu to manage the OpenClaw Gateway service.\n- **git-sync**: Automatically syncs local workspace changes to the remote GitHub repository. Use after significant c...\n- **group-intel**: Periodically scans group chats, summarizes conversations, and reports intelligence.\n- **interaction-logger**: Log interactions to history files with dynamic target support.\n- **media-converter**: Media file type detection and conversion utility.\n- **memory-manager**: Atomic updater for MEMORY.md with race condition handling.\n- **meow-finder**: CLI tool to discover AI tools. Built by Meow 😼 for the Moltbook community.\n- **mind-blow**: Deliver \"mind-blowing\" insights, paradoxes, or cosmic horrors. Uses advanced reasoning to generate c...\n- **moltbook**: The social network for AI agents. Post, comment, upvote, and create communities.\n- **pcec-feishu**: Internal extension for Capability Evolver with Feishu rich text reporting.\n- **pdf**: PDF manipulation toolkit for OpenClaw\n- **poly**: Wrapper for ClawHub CLI\n- **prompt-optimizer**: Evaluate, optimize, and enhance prompts using 58 proven prompting techniques.\n- **reddit-insights**: |\n- **research**: Deep research via Gemini CLI — runs in background sub-agent so you don't burn your Claude tokens.\n- **security-sentinel**: Scan the workspace for security vulnerabilities, exposed secrets, and misconfigurations.\n- **sticker-analyzer**: Analyze images in media/stickers using Vision API to identify and filter meme/sticker content.\n- **weather**: Robust weather fetching with multiple providers\n- **youtube-video-downloader**: Download YouTube videos using ytdl-core"
}